from importlib.resources import contents
from requests import Session
from bs4 import BeautifulSoup
import json

data = json.load(open('data.json', 'r'))

URL = "https://udndata-com.easysearch.lib.fcu.edu.tw:3001/ndapp/Searchdec?udndbid=udndata&page={page}&SearchString={key}%3B%2B%B3%F8%A7%4F%3D%C1%70%A6%58%B3%F8&sharepage=50&select=1&kind=2"

session = Session()
session.headers.update({"User-Agent": "Mozilla/5.0 (Windows NT 6.2; WOW64; rv:34.0) Gecko/20100101 Firefox/34.0"})


class KeywordGroup:

    def __init__(self, name: str, keywords: list[str]):
        self.name = name
        self.keywords = keywords


keyword_groups = [
    KeywordGroup(
        "經濟類",
        [
            "不動產",  # %26%2319981%3B%26%2321205%3B%26%2329986
            "房地產",  # %26%2325151%3B%26%2322320%3B%26%2329986
            "房產",  # %26%2325151%3B%26%2329986
            "房價",  # %26%2325151%3B%26%2320729
        ],
    ),
    KeywordGroup(
        "不確定類",
        [
            "不確定",  # %26%2319981%3B%26%2330906%3B%26%2323450
            "不明確",  # %26%2319981%3B%26%2326126%3B%26%2330906
            "不明朗",  # %26%2319981%3B%26%2326126%3B%26%2326391
            "不透明",  # %26%2319981%3B%26%2336879%3B%26%2326126
            "不穩定",  # %26%2319981%3B%26%2331337%3B%26%2323450
            "難以預料",  # %26%2338627%3B%26%2320197%3B%26%2338928%3B%26%2326009
            "難以預測",  # %26%2338627%3B%26%2320197%3B%26%2338928%3B%26%2328204
            "難以預計",  # %26%2338627%3B%26%2320197%3B%26%2338928%3B%26%2335336
            "難以估計",  # %26%2338627%3B%26%2320197%3B%26%2320272%3B%26%2335336
            "不安",  # %26%2319981%3B%26%2323433
            "歧見",  # %26%2327495%3B%26%2335211
            "未明",  # %26%2326410%3B%26%2326126
            "動盪",  # %26%2321205%3B%26%2330442
            "疑惑",  # %26%2330097%3B%26%2324785
            "惶恐",  # %26%2324822%3B%26%2324656
        ],
    ),
    KeywordGroup(
        "政策類",
        [
            "施政",  # %26%2326045%3B%26%2325919
            "稅",  # %26%2331237
            "稅制",  # %26%2331237%3B%26%2321046
            "課稅",  # %26%2335506%3B%26%2331237
            "稅務",  # %26%2331237%3B%26%2321209
            "稅改",  # %26%2331237%3B%26%2325913
            "法案",  # %26%2327861%3B%26%2326696
            "法規",  # %26%2327861%3B%26%2335215
            "投資",  # %26%2325237%3B%26%2336039
            "改革",  # %26%2325913%3B%26%2338761
            "房貸",  # %26%2325151%3B%26%2336024
            "房屋貸款",  # %26%2325151%3B%26%2323627%3B%26%2336024%3B%26%2327454
            "利率",  # %26%2321033%3B%26%2329575
            "匯率",  # %26%2321295%3B%26%2329575
            "貨幣",  # %26%2336008%3B%26%2324163
            "政策",  # %26%2325919%3B%26%2331574
            "政府",  # %26%2325919%3B%26%2324220
            "官邸",  # %26%2323448%3B%26%2337048
            "國會",  # %26%2322283%3B%26%2326371
            "立法院",  # %26%2331435%3B%26%2327861%3B%26%2338498
            "中央銀行",  # %26%2320013%3B%26%2322830%3B%26%2337504%3B%26%2334892
            "央行",  # %26%2322830%3B%26%2334892
            "泡沫",  # %26%2327873%3B%26%2327819
            "泡沫化",  # %26%2327873%3B%26%2327819%3B%26%2321270
            "貸款成數",  # %26%2336024%3B%26%2327454%3B%26%2325104%3B%26%2325976
            "房貸成數",  # %26%2325151%3B%26%2336024%3B%26%2325104%3B%26%2325976
            "措施",  # %26%2325514%3B%26%2326045
        ],
    ),
]

d = {
    "不動產": "%26%2319981%3B%26%2321205%3B%26%2329986",
    "房地產": "%26%2325151%3B%26%2322320%3B%26%2329986",
    "房產": "%26%2325151%3B%26%2329986",
    "房價": "%26%2325151%3B%26%2320729",
    "不確定": "%26%2319981%3B%26%2330906%3B%26%2323450",
    "不明確": "%26%2319981%3B%26%2326126%3B%26%2330906",
    "不明朗": "%26%2319981%3B%26%2326126%3B%26%2326391",
    "不透明": "%26%2319981%3B%26%2336879%3B%26%2326126",
    "不穩定": "%26%2319981%3B%26%2331337%3B%26%2323450",
    "難以預料": "%26%2338627%3B%26%2320197%3B%26%2338928%3B%26%2326009",
    "難以預測": "%26%2338627%3B%26%2320197%3B%26%2338928%3B%26%2328204",
    "難以預計": "%26%2338627%3B%26%2320197%3B%26%2338928%3B%26%2335336",
    "難以估計": "%26%2338627%3B%26%2320197%3B%26%2320272%3B%26%2335336",
    "不安": "%26%2319981%3B%26%2323433",
    "歧見": "%26%2327495%3B%26%2335211",
    "未明": "%26%2326410%3B%26%2326126",
    "動盪": "%26%2321205%3B%26%2330442",
    "疑惑": "%26%2330097%3B%26%2324785",
    "惶恐": "%26%2324822%3B%26%2324656",
    "施政": "%26%2326045%3B%26%2325919",
    "稅": "%26%2331237",
    "稅制": "%26%2331237%3B%26%2321046",
    "課稅": "%26%2335506%3B%26%2331237",
    "稅務": "%26%2331237%3B%26%2321209",
    "稅改": "%26%2331237%3B%26%2325913",
    "法案": "%26%2327861%3B%26%2326696",
    "法規": "%26%2327861%3B%26%2335215",
    "投資": "%26%2325237%3B%26%2336039",
    "改革": "%26%2325913%3B%26%2338761",
    "房貸": "%26%2325151%3B%26%2336024",
    "房屋貸款": "%26%2325151%3B%26%2323627%3B%26%2336024%3B%26%2327454",
    "利率": "%26%2321033%3B%26%2329575",
    "匯率": "%26%2321295%3B%26%2329575",
    "貨幣": "%26%2336008%3B%26%2324163",
    "政策": "%26%2325919%3B%26%2331574",
    "政府": "%26%2325919%3B%26%2324220",
    "官邸": "%26%2323448%3B%26%2337048",
    "國會": "%26%2322283%3B%26%2326371",
    "立法院": "%26%2331435%3B%26%2327861%3B%26%2338498",
    "中央銀行": "%26%2320013%3B%26%2322830%3B%26%2337504%3B%26%2334892",
    "央行": "%26%2322830%3B%26%2334892",
    "泡沫": "%26%2327873%3B%26%2327819%3B%26%2321270",
    "泡沫化": "%26%2327873%3B%26%2327819%3B%26%2321270",
    "貸款成數": "%26%2336024%3B%26%2327454%3B%26%2325104%3B%26%2325976",
    "房貸成數": "%26%2325151%3B%26%2336024%3B%26%2325104%3B%26%2325976",
    "措施": "%26%2325514%3B%26%2326045",
}

r = session.post(
    "https://easysearch.lib.fcu.edu.tw:3001/login",
    data={
        "url": "https://udndata.com/library/udn",
        "uid": "D1050961",
        "pwd": "ZWE2YzBlMDQwODgwMTdkNzhlNmRiYWEwMjg2MGM4NjNlMGZiNWZhNmFkYzBjMmM1",
    },
)

c = 0
URL = "https://udndata-com.easysearch.lib.fcu.edu.tw:3001/ndapp/Searchdec?udndbid=udndata&page={page}&SearchString={key}%3B%2B%B3%F8%A7%4F%3D%C1%70%A6%58%B3%F8&sharepage=50&select=1&kind=2"
r = session.get("https://udndata-com.easysearch.lib.fcu.edu.tw:3001/ndapp/member/MbFixLogin?pToUrl=/udn/")
for i in keyword_groups[2].keywords:
    for j in keyword_groups[1].keywords:
        for k in keyword_groups[0].keywords:
            page = 1
            stop = False
            while not stop:
                r = session.get(URL.format(page=page, key=d[i] + "%2b" + d[j] + "%2b" + d[k]))
                # print(URL.format(page=page, key=d[i] + "%2b" + d[j] + "%2b" + d[k]))
                soup = BeautifulSoup(r.text, "html.parser")
                news = soup.select("div.news")
                if not news:
                    stop = True
                contents = soup.select("div.list li")
                for content in contents:
                    title = getattr(content.select_one("h2 a"), "text", "")
                    if not title:
                        break
                    title = "".join(title.split(".")[1:])
                    url = "https://udndata-com.easysearch.lib.fcu.edu.tw:3001" + content.select_one("h2 a").get("href")
                    print(url)
                    time = getattr(content.select_one("span"), "text", "")[:10]
                    preview = getattr(content.select_one("p"), "text", "").replace("\r\n\t                    ", "")
                    if url in data:
                        if i not in data[url]["keywords"]["政策類"]:
                            data[url]["keywords"]["政策類"].append(i)
                        if j not in data[url]["keywords"]["不確定類"]:
                            data[url]["keywords"]["不確定類"].append(j)
                        if k not in data[url]["keywords"]["經濟類"]:
                            data[url]["keywords"]["經濟類"].append(k)
                    else:
                        data[url] = {
                            "title": title,
                            "time": time,
                            "preview": preview,
                            "keywords": {
                                "經濟類": [k],
                                "不確定類": [j],
                                "政策類": [i],
                            }
                        }
                page += 1
    json.dump(data, open("data.json", "w", encoding="utf-8"), ensure_ascii=False, indent=4)